Repository: Muneera-Salah/buddypress-links
Catalog: languages/buddypress-links-*.po
Languages: ar

source: BuddyPress Links
ar: BuddyPress روابط

source: BP Links
ar: BP روابط

source: General Info
ar: معلومات عامه

source: Edit Settings
ar: تحرير الإعدادات

source: Edit Categories
ar: تحرير التصنيفات

source: Manage Links
ar: إدارة الروابط

source: There were errors when deleting links.
ar: . توجد هناك أخطاء عند حذفك لهذا الرابط

source: Please try again.
ar: الرجاء أعد المحاولة .

source: Links deleted successfully
ar: تم حذف الرابط بنجاح

source: You do not have sufficient permissions to edit link categories for this blog.
ar: .لايوجد لديك صلاحيات كافيه لتعديل تصنيفات الرابط لهذه المدونة

source: Categories deleted successfully
ar: التصنيفات حذفت بنجاح

source: There were errors when deleting categories.
ar: يوجد أخطاء عند حذف التصنيفات

source: Unable to delete a category because it is assigned to one or more links
ar: غير قادر على حذف التصنيف لسبب تعيينه على رابط أو أكثر من رابط

source: Link category slug from this name already exists.
ar: الإسم لرابط التصنيف موجود مسبقا

source: Link category name must be %1$d to %2$d characters in length.
ar: حرف الى %2$d %1$dإلى اسم التصنيف لابد ان يكون طوله بين

source: Link category name is required.
ar: مطلوب رابط اسم التصنيف

source: Link category description must be %1$d to %2$d characters in length.
ar: وصف رابط التنصيف يجب أن يكون %1$d إلى %2$d عدد من الحروف

source: Link category priority must be a number from %1$d to %2$d.
ar: %2$d الى %1$d الأولوية لتصنيف الروابط لابد أن يكون رقم من

source: Link category priority is required.
ar: أولوية تصنيف الرابط مطلوبة

source: Link category saved!
ar: ! تم حفظ رابط التصنيف

source: Return to list
ar: الرجوع إلى القائمة

source: or
ar: أو

source: Create new category
ar: إنشاء تصنيف جديد

source: There were errors when saving the link category.
ar: يوجد أخطاء عند حفظ رابط التصنيف

source: Edit Category
ar: تعديل التصنيف

source: Update Category
ar: حدّث التصنيف

source: New Category
ar: تصنيف جديد

source: Add Category
ar: إضافة تصنيف

source: Vote recorded.
ar: التصويت مُسجل

source: You have already voted.
ar: لقد قمت بالتصويت مسبقا

source: There was a problem recording your vote. Please try again.
ar: يوجد هناك مشكله في تسجيل تصويتك . من فضلك أعد المحاوله مرة آخرى .

source: You must be logged in to vote!
ar: يجب عليك أن تسجل دخولك من أجل التصويت!

source: Auto-fill not available for this URL.
ar: التدوين الآلي غير متوفرة لعنوان الرابط

source: Invalid request
ar: طلب غير صحيح

source: Every %1$d minutes
ar: كل %1$d دقائق

source: Links
ar: الروابط

source: My Links
ar: روابطي

source: Create
ar: إنشاء

source: Home
ar: الرئيسية

source: Admin
ar: الإدارة

source: List
ar: قوائم

source: Admin Options
ar: خيارات المشرف

source: Delete Link
ar: حذف الرابط

source: Random Link
ar: رابط عشوائي

source: Link details were successfully updated.
ar: تم تحديث تفاصيل الرابط بنجاح.

source: There was an error updating link details.
ar: يوجد هناك خطأ عند تحديث تفاصيل الرابط

source: Your avatar was deleted successfully!
ar: تم حذف الصوره الرمزيه بنجاح !

source: There was a problem deleting that avatar
ar: يوجد هناك مشكله عند حذف الصوره الرمزيه

source: The link avatar was uploaded successfully!
ar: تم تحميل رابط الصوره الرمزيه بنجاح!

source: There was an error saving link avatar.
ar: هناك خطأ عند حفظ الصوره الرمزيه .

source: The link was deleted successfully
ar: تم حذف الرابط بنجاح

source: There was an error deleting the link, please try again.
ar: يوجد هناك خطأ عند حذف الرابط . من فضلك أعد المحاوله مرة آخرى .

source: Please fill in all of the required fields
ar: يرجى تعبئه جميع الحقول المطلوبه

source: Link URL must be %1$d characters or less, please make corrections and re-submit.
ar: رابط العنوان لابد أن يكون %1$d حروف أول أقل, الرجاء التأكد من ذلك و إعادة الإرسال

source: The URL you entered is not valid.
ar: عنوان الرابط الذي أدخلته غير صحيح .

source: Link Name must be %1$d characters or less, please make corrections and re-submit.
ar: رابط العنوان لابد أن يكون %1$d حروف أو أقل , الرجاء التأكد من ذلك وإعادة الإرسال.

source: Link Description must be %1$d characters or less, please make corrections and re-submit.
ar: وصف الرابط لابد أن يكون %1$d حروف أو أقل , الرجاء التأكد من ذلك وإعادة الإرسال

source: %1$s created the link %2$s
ar: %1$s تم إنشاء الرابط %2$s

source: There was an error saving link details.
ar: هناك خطأ عند حفظ تفاصيل الرابط .

source: Created a link
ar: تم إنشاء رابط

source: Voted on a link
ar: تم التصويت على الرابط

source: Commented on a link
ar: تم التعليق على الرابط

source: Link Avatar
ar: رابط الصورة الرمزية

source: up
ar: أعلى

source: down
ar: أسفل

source: Show Link Created
ar: عرض الروابط المنشاة

source: Show Link Comments
ar: عرض تعليقات الرابط

source: Show Link Votes
ar: عرض تصويتات الرابط

source: Search anything...
ar: البحث عن أي شيء ...

source: Search
ar: بحث

source: Start Over
ar: البدء من جديد

source: Order By:
ar: ترتيب على حسب:

source: Category:
ar: التصنيف:

source: All
ar: كل

source: Downloading content details from %1$s failed.
ar: من تحميل تفاصيل المحتوى %1$s فشل.

source: URL
ar: عنوان URL

source: The URL you entered is not a valid %1$s link.
ar: رابط عنوان (URL) الذي أدخلته غير صالح %1$s .

source: Web Page
ar: صفحة الإنترنت

source: YouTube
ar: يويتوب

source: Flickr
ar: فليكر

source: Upload Failed! Error was:
ar: فشل التحميل ! هناك خطأ :

source: Downloading image from remote website failed.
ar: تحميل الصور من موقع عن بعد فشلت .

source: The embedding code you entered was not recognized.
ar: لم يتم التعرف على رمز التضمين الذي أدخلته.

source: Clear
ar: أزال

source: Fetch Page Details
ar: جلب تفاصيل الصفحة

source: Rich Media Detected:
ar: الكشف عن الوسائط المتعددة التفاعلية:

source: Edit Name and Description
ar: تعديل الاسم والوصف

source: Thumbs
ar: صورة مصغرة

source: No Thumbnail
ar: لا توجد صورة مصغرة

source: Global Settings
ar: إعدادت عالمية

source: List Avatar Size
ar: قائمة حجم الصورالرمزية

source: Set the default avatar size for link lists.
ar: تعيين حجم صورة رمزية افتراضية لقائمة الروابط

source: Link to local page?
ar: ربط إلى الصفحة المحلية؟

source: The default behavior is to link the title link to the local link page when a link is clicked. Set this to No to send them directly to the external url.
ar: السلوك الافتراضي هو ربط عنوان الرابط إلى صفحة الرابط المحلية عندما يتم النقر . تعيين هذا إلى لا لإرسالهم مباشرة غلى رابط خارجي url

source: Content Settings
ar: إعدادات المحتوى

source: Max. URL Characters
ar: Max. حروف عنوان URL

source: Set this to the maximum number of characters allowed for a link URL. (Must be 255 or lower)
ar: تعيين الحد الأقصى لعدد الأحرف المسموح بها عنوان الرابط URL .(يجب أن يكون 255 أو أقل)

source: Max. Name Characters
ar: Max.اسم الحروف

source: Set this to the maximum number of characters allowed for a link name/title. (Must be 255 or lower)
ar: تعيين الحد الأقصى لعدد الأحرف المسموح بها لاسم / عنوان الرابط .(يجب أن يكون 255 أو أقل)

source: Max. Description Characters
ar: Max. وصف الحروف

source: Set this to the maximum number of characters allowed for a link description.
ar: تعيين الحد الأقصى لعدد الأحرف المسموح بها للحصول على وصف الرابط .

source: Is description required?
ar: هل الوصف مطلوب ؟

source: By default, every link must have a description. Set this to No to allow empty descriptions.
ar: بشكل افتراضي، يجب أن يكون لكل وصلة وصفاً . تعيين هذا إلى لا للسماحأوصاف فارغة.

source: Category Input Type
ar: نوع تصنيف الإدخال

source: The default behavior is to use radio buttons to display categories on the create form. Set this to Select to use a select box instead.
ar: السلوك الافتراضي هو استخدام أزرار الراديو لعرض تصنيفات فيإنشاء النموذج. حدد هذا لاختار استخدام مربعات الخيارات بدلا من ذلك.

source: Voting Settings
ar: إعدادات التصويت

source: Can members change their vote?
ar: يمكن للأعضاء تغير تصويتهم؟

source: The default behavior is to allow members to change their vote. Set this to No to prevent vote changing.
ar: السلوك الافتراضي للسماح للأعضاء لتغيير تصويتهم. حدده إلىلا لمنع تغيير التصويت.

source: Record voting activity?
ar: سجل التصويت نشط؟

source: Profile Settings
ar: إعدادات الملف الشخصي

source: Max. Activity History
ar: Max.تاريخ النشاط

source: Groups Settings
ar: اعدادات المجموعات

source: Groups integration
ar: تكامل المجموعات

source: Integration with the groups component is On by default. Set this to Off to disable all integration with groups.
ar: التكامل مع المكون مجموعات متاحة بشكل افتراضي. حدده إلى إيقاف لتعطيل التكامل معالمجموعات.

source: A Group
ar: المجموعة

source: All Group Links
ar: كل روابط المجموعة

source: Cancel
ar: إلغاء

source: Create Group Link
ar: إنشاء رابط للمجموعة

source: Loading sharing options has failed.
ar: فشل تحميل خيارات المشاركة

source: My Group Links
ar: روابط مجموعتي

source: Please Choose
ar: الرجاء الاختيار

source: Remove from Group
ar: إزالة من المجموعة

source: Remove from Profile
ar: إزالة من الملف الشخصي

source: Removing this link from your profile has failed.
ar: فشلت إزالة هذا الرابط من ملفك الشخصي .

source: Removing this link from this group has failed.
ar: فشلت إزالة هذا الرابط من هذه المجموعة .

source: Select a group:
ar: اختر المجموعة:

source: Share
ar: شارك

source: Share Now
ar: شارك الآن

source: Share this link in:
ar: شارك هذا الرابط في :

source: Sharing a link with yourself is not allowed.
ar: مشاركة رابط مع نفسك غير مسموح .

source: Sharing this link has failed.
ar: فشلت مشاركة هذا الرابط .

source: Sharing this link in your profile has failed.
ar: فشلت مشاركة هذا الرابط في ملفك الشخصي .

source: Sharing with a group has failed.
ar: فشلت المشاركه مع المجموعه .

source: This link has already been shared in your profile.
ar: تم مشاركة هذا الرابط بالفعل مسبقاً بملفك الشخصي .

source: This link has been shared in your profile.
ar: تمت مشاركة هذا الرابط في ملفك الشخصي.

source: This link has already been shared with the %s group.
ar: هذا الرابط تمت مشاركته مسبقاً في %s مجموعة.

source: This link has been removed from this group.
ar: تمت إزالة هذا الرابط من هذه المجموعة .

source: This link has been removed from your profile.
ar: تمت إزالة هذا الرابط من ملفك َ الشخصي .

source: This link has been shared with the %s group.
ar: تمت مشاركة هذا الرابط في %s مجموعة.

source: You are not a member of the %s group.
ar: أنت لست عضواً في %s مجموعة.

source: You must be logged in to remove links.
ar: يجب أن تكون مسجلاً لتزيلالروابط .

source: You must be logged in to share links.
ar: يجب أن تكون مسجلاً لتشارك الروابط .

source: Public Link
ar: رابط عام

source: Friends Only Link
ar: رابط فقط للأصدقاء

source: Hidden Link
ar: رابط مخفي

source: Link
ar: رابط

source: not yet active
ar: لم تصبح بعد نشطة

source: %s vote
ar: %s صوت

source: %s votes
ar: %s أصوات

source: Edit Details
ar: تعديل التفاصيل

source: This is a hidden link. Only the user who owns it can view it.
ar: هذا هو الرابط الخفي. فقط المستخدم الذي يملك مشاهدته

source: This is a friends only link. Only the owner's friends can view it.
ar: هذا هو الرابط أصدقاء فقط. الأصدقاءالمالكين هم فقط يمكن مشاهدته

source: You do not have permission to access this link.
ar: لم يكن لديك إذن للوصول إلى هذا الرابط.

source: Yes
ar: نعم

source: No
ar: لا

source: A member posts a comment on a link you created
ar: الأعضاء يشاركون بالتعليق على الرابط الذي أنشأته

source: Votes
ar: أصوات

source: External Link
ar: رابط خارجي

source: more...
ar: أكثر ...

source: Comments
ar: تعليقات

source: created %s
ar: تم إنشاء %s

source: Last Active
ar: آخر نشاط

source: Most Popular
ar: الأكثر شُهرةً

source: Newly Created
ar: ًتم إنشاؤه حديثا

source: Most Votes
ar: الأكثر تصويتا ً

source: Highest Rated
ar: ًالأعلى تقييما

source: Your BuddyPress Links
ar: الخاص BuddyPress روابط

source: Newest
ar: أحدث

source: Active
ar: نشط

source: Rating
ar: التقييم

source: Popular
ar: مشهور

source: There are no links to display.
ar: عدم وجود روابط للعرض .

source: Max links to show:
ar: الحدالأقصى لعرض الروابط:

source: No links matched the current filter.
ar: لا وجود روابط حاليه لتصفيه المتطابقه

source: Most Recent Links
ar: أكثر الروابط المحدثة

source: Link Activity
ar: نشاطات الرابط

source: %s - Link Activity Feed
ar: %s - تغذية نشاطات الروابط

source: Comments: %s
ar: تعليقات: %s

source: My Links - Public Activity
ar: روابطي -نشاطات عامة

source: Save Changes
ar: حفظ التغييرات

source: Link Category Name
ar: أسم رابط التصنيف

source: Description (optional)
ar: (الوصف (اختياري

source: Priority (optional)
ar: (الأولوية (اختياري

source: to
ar: ل

source: Search Categories
ar: بحث فيالتصنيفات

source: Delete
ar: حذف

source: Are you sure?
ar: هل أنت متأكد؟

source: Categories matching:
ar: تطابق التصنيفات :

source: Name
ar: الإسم

source: Description
ar: الوصف

source: Priority
ar: الأولويه

source: Edit
ar: تعديل

source: No categories found.
ar: لم يتم العثور على تصنيفات

source: Thank you for installing BuddyPress Links!
ar: شكرا لكم لتثبيت روابط BuddyPress!

source: Version Information
ar: إصدار المعلومات

source: Base:
ar: قاعدة:

source: Purchase
ar: شراء

source: collection.
ar: مجموعة .

source: Details
ar: تفاصيل

source: Category
ar: تصنيف

source: Type
ar: نوع

source: Owner
ar: المالك

source: Created
ar: تم الإنشاء

source: No links found.
ar: لم يتك العثور على رابط .

source: Comment on this link, %s?
ar: علّق على هذاالرابط, %s?

source: Post Update
ar: نشر تحديث

source: Create a Link
ar: إنشاء رابط

source: Links Directory
ar: دليل الروابط

source: All Links
ar: كل الروابط

source: This link will NOT be listed in the links directory or in search results.
ar: هذا الرابط لن يتم إدراجه في دليل الروابط أو نتائج البحث

source: Link content and activity will only be visible to your friends.
ar: رابط المحتوى والنشاط سيكون مرئي لأصدقائك فقط .

source: This is a hidden link
ar: هذا الرابط مخفي

source: Only you can see the link.
ar: فقط أنت من يمكنك مشاهده الرابط .

source: Link content and activity will only be visible to you.
ar: رابط المحتوى والنشاط سيكون مرئي لك فقط .

source: Save Link
ar: حفظ الرابط

source: Link Owner
ar: مالك الرابط

source: active %s
ar: نشط %s
